{
  "backend/main.mo": "Implements a simple session store for WebRTC signaling, handling offers, answers, and ICE candidate exchange between host and guest.",
  "feature_evidence.json": "Feature evidence report describing removal of a footer attribution line and listing related files, components, and metadata.",
  "frontend-file-summaries.txt": "Text file containing auto-generated summaries of key frontend modules and components.",
  "frontend/android/.gitignore": "Gitignore rules for Android builds, excluding generated, build, and sensitive keystore files.",
  "frontend/android/app/build.gradle": "Gradle build config for the Android app defining SDK versions, dependencies, build types, and signing behavior.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest declaring app permissions, main activity, FileProvider, and supported hardware features.",
  "frontend/android/app/src/main/java/com/filedrop/app/admob/AdMobNativePlugin.java": "Empty placeholder file for a potential AdMob native plugin.",
  "frontend/android/app/src/main/java/com/filedrop/app/admob/NativeAdRenderer.java": "Empty placeholder file for native ad rendering.",
  "frontend/android/app/src/main/java/com/filedrop/app/MainActivity.java": "Main Capacitor bridge activity bootstrapping the Android application.",
  "frontend/android/app/src/main/res/drawable/ic_launcher_foreground_legacy.xml": "Vector drawable defining the legacy FileDrop launcher icon.",
  "frontend/android/app/src/main/res/drawable/ic_launcher_foreground.xml": "Empty launcher foreground drawable placeholder.",
  "frontend/android/app/src/main/res/drawable/splash_icon_legacy.xml": "Vector drawable defining the legacy splash icon graphic.",
  "frontend/android/app/src/main/res/drawable/splash_icon.xml": "Empty splash icon placeholder drawable.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Layer-list drawable defining splash background and centered splash icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout containing a CoordinatorLayout with a FrameLayout container for the main activity.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Adaptive round launcher icon referencing background and foreground drawables.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon referencing background and foreground drawables.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resource definitions for splash screen and theme colors.",
  "frontend/android/app/src/main/res/values/ic_launcher_background.xml": "Color resource defining launcher background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources containing app name and package identifiers.",
  "frontend/android/app/src/main/res/values/themes.xml": "Defines main app theme and splash screen launcher theme.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "FileProvider paths configuration enabling file access from app cache and files directories.",
  "frontend/android/build.gradle": "Top-level Gradle build file configuring repositories and global build settings.",
  "frontend/android/gradle.properties": "Gradle properties configuring JVM args, AndroidX, ABI settings, and signing placeholders.",
  "frontend/android/keystore/README.md": "Instructions for creating and managing the release keystore without committing it.",
  "frontend/android/settings.gradle": "Gradle settings defining project modules and Capacitor integration.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, build settings, server config, and splash plugin options.",
  "frontend/docs/play-store/DATA_SAFETY_NOTES.md": "Explains FileDrop’s Google Play data safety responses, emphasizing zero data collection and detailing permissions for camera and storage.",
  "frontend/docs/play-store/LISTING_METADATA_EN.md": "Provides English Play Store listing text including descriptions, features, tags, requirements, and release notes for FileDrop.",
  "frontend/docs/play-store/PLAY_STORE_CHECKLIST.md": "A step-by-step checklist for preparing, building, testing, and submitting FileDrop to the Google Play Store.",
  "frontend/index.css": "Tailwind-based stylesheet defining light and dark theme CSS variables and global styles.",
  "frontend/index.html": "Main HTML entrypoint setting metadata, icons, manifest, and mounting the frontend application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, categories, and screenshots for AirShare.",
  "frontend/public/privacy.html": "Privacy policy stating FileDrop collects no personal data and only uses temporary signaling metadata for peer-to-peer transfers.",
  "frontend/README_ANDROID.md": "Guide for building the Android version of FileDrop, covering prerequisites and setup steps.",
  "frontend/src/App.tsx": "Top-level app managing session roles, WebRTC state, and rendering appropriate session screens based on sessionState.",
  "frontend/src/features/ads/components/NativeAdCard.tsx": "Empty placeholder file for a native ad card component.",
  "frontend/src/features/ads/nativeAdmob/nativeAdmob.ts": "Empty placeholder for AdMob integration logic.",
  "frontend/src/features/ads/nativeAdmob/nativeAdmobPlugin.ts": "Empty placeholder for an AdMob plugin wrapper.",
  "frontend/src/features/ads/nativeAdmob/useNativeAd.ts": "Empty placeholder for a hook to load and manage native ads.",
  "frontend/src/features/session/components/BrandHeader.tsx": "Renders the top app header with logo and brand title.",
  "frontend/src/features/session/components/ConnectedSessionScreen.tsx": "Displays UI for an active WebRTC session, handling file selection, incoming transfers, and progress UI.",
  "frontend/src/features/session/components/ErrorBanner.tsx": "Reusable error banner component with retry and dismiss actions.",
  "frontend/src/features/session/components/LandingScreen.tsx": "Initial landing UI showing feature highlights and options to start as sender or receiver.",
  "frontend/src/features/session/components/QRCodePanel.tsx": "Generates and displays a QR code for sharing the session code.",
  "frontend/src/features/session/components/ReceiverJoinScreen.tsx": "Receiver-side screen for joining a session via manual code or QR scanning and establishing WebRTC connection.",
  "frontend/src/features/session/components/SenderSessionScreen.tsx": "Sender-side screen that generates a session code, shows QR, and waits for the receiver to connect.",
  "frontend/src/features/session/components/SessionStatusHeader.tsx": "Shows connection status and session code with an option to disconnect.",
  "frontend/src/features/session/state/sessionMachine.ts": "Defines session state types and context structure for session handling.",
  "frontend/src/features/session/utils/joinCode.ts": "Generates, validates, formats session codes and handles simple QR payload encoding/decoding.",
  "frontend/src/features/session/utils/qrCodeGenerator.ts": "Creates a simplified, non‑spec QR code rendering on a canvas using deterministic hashing and basic QR patterns.",
  "frontend/src/features/session/utils/sessionExpiry.ts": "Provides time‑to‑live logic for sessions, including expiry checks and formatted remaining time.",
  "frontend/src/features/transfer/components/FilePermissionPromptCard.tsx": "UI card component for Android file‑permission flows, showing rationale, denial, or checking states.",
  "frontend/src/features/transfer/components/FilePicker.tsx": "File selection component integrating Android permission flow, file list management, and picker activation.",
  "frontend/src/features/transfer/components/IncomingTransferPrompt.tsx": "Displays incoming file transfer details and size totals, allowing the user to accept or decline.",
  "frontend/src/features/transfer/components/TransferProgressCard.tsx": "Shows file transfer progress with percentage, sizes, role‑based icons, and cancel/complete handling.",
  "frontend/src/features/transfer/hooks/useAndroidFilePickerPermissions.ts": "Manages Android runtime permission flow for file picking, including checking, requesting, and opening settings.",
  "frontend/src/features/transfer/hooks/useWebRTCDataChannelTransfer.ts": "Implements chunked file transfer over a WebRTC data channel with progress tracking and metadata exchange.",
  "frontend/src/features/transfer/utils/download.ts": "Provides a helper to trigger browser downloads from Blob objects.",
  "frontend/src/features/transfer/utils/permissionCopy.ts": "Generates Android-specific permission text for media or storage access and provides a generic fallback.",
  "frontend/src/features/webrtc/hooks/usePeerConnection.ts": "Sets up a WebRTC peer connection with data channel handling and polling-based offer/answer exchange via an actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder exporting nothing for centralized query handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes and UI defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, typography, animations, and plugin integrations.",
  "project_state.json": "Defines overall project metadata, existing features, architectural notes, and versioned state for an Android-packaged WebRTC file‑transfer app. Describes requirements, signaling design, UI features, and release considerations."
}