{
  "backend/main.mo": "Motoko backend actor managing WebRTC session offers, answers, and ICE candidate exchange using a map of session codes.",
  "feature_evidence.json": "Feature evidence report listing permission-related improvements and associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend source file paths to short summaries describing their roles in the app.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, logs, and keystore files.",
  "frontend/android/app/build.gradle": "Android app Gradle config defining SDK versions, build types, signing, dependencies, and Capacitor integration.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest declaring app permissions, features, main activity, FileProvider, and application metadata.",
  "frontend/android/app/src/main/java/com/filedrop/app/admob/AdMobNativePlugin.java": "Placeholder file for a native AdMob plugin with no implementation.",
  "frontend/android/app/src/main/java/com/filedrop/app/admob/NativeAdRenderer.java": "Placeholder file for rendering native ads with no implementation.",
  "frontend/android/app/src/main/java/com/filedrop/app/MainActivity.java": "Main Capacitor BridgeActivity subclass initializing the Android app.",
  "frontend/android/app/src/main/res/drawable/ic_launcher_foreground_legacy.xml": "Vector drawable defining the legacy FileDrop launcher foreground icon.",
  "frontend/android/app/src/main/res/drawable/ic_launcher_foreground.xml": "Empty placeholder for launcher icon foreground drawable.",
  "frontend/android/app/src/main/res/drawable/splash_icon_legacy.xml": "Vector drawable defining the legacy FileDrop splash icon artwork.",
  "frontend/android/app/src/main/res/drawable/splash_icon.xml": "Empty placeholder drawable for splash icon.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Layer-list drawable showing splash background and centered splash icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout defining CoordinatorLayout and main container frame for the app.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon referencing background and foreground drawables.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive icon specifying background and foreground drawables.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resource definitions including splash and primary theme colors.",
  "frontend/android/app/src/main/res/values/ic_launcher_background.xml": "Resource defining launcher icon background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources defining app name and package identifiers.",
  "frontend/android/app/src/main/res/values/themes.xml": "App and launcher theme definitions including splash screen settings.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "FileProvider path configuration for cache, external, and internal file access.",
  "frontend/android/build.gradle": "Top-level Gradle config setting repositories, buildscript dependencies, and clean task.",
  "frontend/android/gradle.properties": "Project-wide Gradle settings including JVM args, AndroidX flags, and ABI configuration.",
  "frontend/android/keystore/README.md": "Instructions for generating and storing the release signing keystore without committing it.",
  "frontend/android/settings.gradle": "Gradle settings configuring repositories, project includes, and Capacitor modules.",
  "frontend/capacitor.config.ts": "Capacitor configuration for app metadata, Android build options, server settings, and splash plugin.",
  "frontend/docs/play-store/DATA_SAFETY_NOTES.md": "Explains FileDrop’s Google Play Data Safety answers, stating that no user data is collected and permissions are used only for QR scanning and file selection.",
  "frontend/docs/play-store/LISTING_METADATA_EN.md": "Provides the prepared English Play Store listing text for FileDrop, including descriptions, features, tags, and release notes.",
  "frontend/docs/play-store/PLAY_STORE_CHECKLIST.md": "A detailed checklist outlining steps for building, preparing assets, and submitting FileDrop to the Google Play Store.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "HTML entry point for the AirShare web app, setting metadata, icons, manifest, and loading the main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining the AirShare app’s name, icons, colors, screenshots, and display settings.",
  "frontend/public/privacy.html": "Privacy policy stating that FileDrop collects no personal data and only uses temporary session and signaling metadata for peer-to-peer transfers.",
  "frontend/README_ANDROID.md": "Guide for building the Android app including prerequisites, setup steps, and Capacitor usage.",
  "frontend/src/App.tsx": "Main app component managing session role, WebRTC state, and rendering the appropriate screen based on session state.",
  "frontend/src/features/ads/components/NativeAdCard.tsx": "Empty placeholder file for a native ad card component.",
  "frontend/src/features/ads/nativeAdmob/nativeAdmob.ts": "Empty placeholder file for AdMob integration logic.",
  "frontend/src/features/ads/nativeAdmob/nativeAdmobPlugin.ts": "Empty placeholder file for an AdMob plugin wrapper.",
  "frontend/src/features/ads/nativeAdmob/useNativeAd.ts": "Empty placeholder file for a hook to load native ads.",
  "frontend/src/features/session/components/BrandHeader.tsx": "Renders the app's header with logo and title.",
  "frontend/src/features/session/components/ConnectedSessionScreen.tsx": "UI for active WebRTC sessions handling file selection, incoming transfers, and progress display.",
  "frontend/src/features/session/components/ErrorBanner.tsx": "Displays an error message with optional retry and dismiss actions.",
  "frontend/src/features/session/components/LandingScreen.tsx": "Landing page allowing users to choose sender or receiver mode with feature highlights.",
  "frontend/src/features/session/components/QRCodePanel.tsx": "Generates and displays a QR code for a session code using a canvas.",
  "frontend/src/features/session/components/ReceiverJoinScreen.tsx": "UI for receivers to join sessions via manual code entry or QR scanning and manage connection flow.",
  "frontend/src/features/session/components/SenderSessionScreen.tsx": "Sender-side UI for generating a session code, showing a QR code, and waiting for receiver connection.",
  "frontend/src/features/session/components/SessionStatusHeader.tsx": "Shows connection status, session code, and a disconnect button.",
  "frontend/src/features/session/state/sessionMachine.ts": "Defines session state types and context shape for session flow.",
  "frontend/src/features/session/utils/joinCode.ts": "Generates, validates, and formats session codes and builds or parses simple QR payload strings.",
  "frontend/src/features/session/utils/qrCodeGenerator.ts": "Creates a simplified, non‑spec‑compliant QR code on a canvas using hashing and basic pattern placement.",
  "frontend/src/features/session/utils/sessionExpiry.ts": "Provides utilities to compute session expiry timestamps, check expiration, and format remaining time.",
  "frontend/src/features/transfer/components/FilePermissionPromptCard.tsx": "UI card component rendering rationale, denied, or checking states for Android file‑picker permissions.",
  "frontend/src/features/transfer/components/FilePicker.tsx": "File selection component integrating Android permission flow and listing selected files with removal and transfer actions.",
  "frontend/src/features/transfer/components/IncomingTransferPrompt.tsx": "Displays incoming file transfer details and lets the user accept or decline the transfer.",
  "frontend/src/features/transfer/components/TransferProgressCard.tsx": "Shows file transfer progress, size metrics, and completion or cancel controls for sender or receiver roles.",
  "frontend/src/features/transfer/hooks/useAndroidFilePickerPermissions.ts": "React hook managing Android file‑picker permission state, checking, requesting, and settings redirection.",
  "frontend/src/features/transfer/hooks/useWebRTCDataChannelTransfer.ts": "Manages WebRTC data channel file transfers, including metadata exchange, chunked sending, progress tracking, and handling incoming files.",
  "frontend/src/features/transfer/utils/download.ts": "Provides a helper to trigger browser downloads from a Blob using a temporary object URL.",
  "frontend/src/features/transfer/utils/permissionCopy.ts": "Supplies Android-specific permission text sets for storage/media access with fallback messaging.",
  "frontend/src/features/webrtc/hooks/usePeerConnection.ts": "Sets up and manages an RTCPeerConnection, handles ICE candidates, and coordinates offer/answer and data channel creation based on role.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication state, providing login, logout, identity loading, and context management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, noting that queries are defined in feature-specific hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables, including light/dark mode color tokens and global UI tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Holds the current project schema, version, feature list, and architectural notes for an Android/React/WebRTC file‑transfer app. Captures existing capabilities, release considerations, and requirements for signaling, UI, and Android packaging."
}